CSI API ETABS v1
cCaseStaticNonlinearStaged.SetStageData_2 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetStageData_2(
	string Name,
	int Stage,
	int NumberOperations,
	ref int[] Operation,
	ref string[] ObjectType,
	ref string[] ObjectName,
	ref double[] Age,
	ref string[] MyType,
	ref string[] MyName,
	ref double[] SF
)
Function SetStageData_2 (
	Name As String,
	Stage As Integer,
	NumberOperations As Integer,
	ByRef Operation As Integer(),
	ByRef ObjectType As String(),
	ByRef ObjectName As String(),
	ByRef Age As Double(),
	ByRef MyType As String(),
	ByRef MyName As String(),
	ByRef SF As Double()
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim Stage As Integer
Dim NumberOperations As Integer
Dim Operation As Integer()
Dim ObjectType As String()
Dim ObjectName As String()
Dim Age As Double()
Dim MyType As String()
Dim MyName As String()
Dim SF As Double()
Dim returnValue As Integer
returnValue = instance.SetStageData_2(Name,
	Stage, NumberOperations, Operation,
	ObjectType, ObjectName, Age, MyType,
	MyName, SF)
int SetStageData_2(
	String^ Name,
	int Stage,
	int NumberOperations,
	array<int>^% Operation,
	array<String^>^% ObjectType,
	array<String^>^% ObjectName,
	array<double>^% Age,
	array<String^>^% MyType,
	array<String^>^% MyName,
	array<double>^% SF
)
abstract SetStageData_2 :
        Name : string *
        Stage : int *
        NumberOperations : int *
        Operation : int[] byref *
        ObjectType : string[] byref *
        ObjectName : string[] byref *
        Age : float[] byref *
        MyType : string[] byref *
        MyName : string[] byref *
        SF : float[] byref -> int
Parameters
Name
Type: System.String
Stage
Type: System.Int32
NumberOperations
Type: System.Int32
Operation
Type: System.Int32[]
ObjectType
Type: System.String[]
ObjectName
Type: System.String[]
Age
Type: System.Double[]
MyType
Type: System.String[]
MyName
Type: System.String[]
SF
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace